### Pandas- DataFrame and Series

It is a powerful data manipulation library used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A series is a 1D array like object while a DataFrame is 2D, size mutable and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
import pandas as pd

In [2]:
## Series - 1D

import pandas as pd 
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
## Create a Series from Dictionaries
data = {'a':1, 'b':2, 'c':3}
series_dict= pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
data=[10,20,30]
index=['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [5]:
# Data Frame
#Create a DataFrame from a dictionar of a list 
import pandas as pd
data={
    'Name':['Angela', 'Masaki', 'Paul'],
    'Age': [23,25,30],
    'City':['Nairobi', 'Mombasa', 'Kisumu']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age     City
0  Angela   23  Nairobi
1  Masaki   25  Mombasa
2    Paul   30   Kisumu
<class 'pandas.core.frame.DataFrame'>

In [6]:
import numpy as np
np.array(df)

array([['Angela', 23, 'Nairobi'],
       ['Masaki', 25, 'Mombasa'],
       ['Paul', 30, 'Kisumu']], dtype=object)

In [7]:
# Create a data frame from a list of dictinaries 

data=[
    {'Name':'Angela', 'Age':23, 'City':'Nairobi'},
    {'Name':'Jack', 'Age':27, 'City':'Mombasa'},
    {'Name':'Paul', 'Age':24, 'City':'Kisumu'},
    {'Name':'SamSam', 'Age':21, 'City':'Kisii'},
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age     City
0  Angela   23  Nairobi
1    Jack   27  Mombasa
2    Paul   24   Kisumu
3  SamSam   21    Kisii
<class 'pandas.core.frame.DataFrame'>

In [8]:
dt=pd.read_csv('sales_data.csv')
print(dt.head(7))

   Transaction ID        Date Product Category                 Product Name  \
0           10001  2024-01-01      Electronics                iPhone 14 Pro
1           10002  2024-01-02  Home Appliances             Dyson V11 Vacuum
2           10003  2024-01-03         Clothing             Levi's 501 Jeans
3           10004  2024-01-04            Books            The Da Vinci Code
4           10005  2024-01-05  Beauty Products      Neutrogena Skincare Set
5           10006  2024-01-06           Sports  Wilson Evolution Basketball
6           10007  2024-01-07      Electronics          MacBook Pro 16-inch

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal
5           5       29.99         149.95           Asia    Credit Card
6           1     2499.99        2499.99  North America    Credit Card

In [9]:
print(dt.tail(5))

     Transaction ID        Date Product Category  \
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

In [10]:
# Accessing data from data frame
df

     Name  Age     City
0  Angela   23  Nairobi
1    Jack   27  Mombasa
2    Paul   24   Kisumu
3  SamSam   21    Kisii

In [11]:
df['Name']

0    Angela
1      Jack
2      Paul
3    SamSam
Name: Name, dtype: object

In [12]:
df.loc[0]

Name     Angela
Age          23
City    Nairobi
Name: 0, dtype: object

In [13]:
df.iloc[1]

Name       Jack
Age          27
City    Mombasa
Name: 1, dtype: object

In [14]:
df.iloc[1][2]

/var/folders/jg/_tlplb5x29sg5lm509cb74xc0000gn/T/ipykernel_2309/65333983.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

'Mombasa'

In [15]:
df.loc [1][1]

/var/folders/jg/_tlplb5x29sg5lm509cb74xc0000gn/T/ipykernel_2309/3931728170.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc [1][1]

np.int64(27)

In [16]:
# Accesing a specified element
df

     Name  Age     City
0  Angela   23  Nairobi
1    Jack   27  Mombasa
2    Paul   24   Kisumu
3  SamSam   21    Kisii

In [17]:
df.at[1,'Age'] #27

np.int64(27)

In [18]:
df.at[2,'Name']

'Paul'

In [19]:
df.iat[2,2]

'Kisumu'

In [20]:
## Data Manipulation with DataFrame
df

     Name  Age     City
0  Angela   23  Nairobi
1    Jack   27  Mombasa
2    Paul   24   Kisumu
3  SamSam   21    Kisii

In [21]:
# ADD colum
df['Salary']=[7000,4000,9000,1000]
df

     Name  Age     City  Salary
0  Angela   23  Nairobi    7000
1    Jack   27  Mombasa    4000
2    Paul   24   Kisumu    9000
3  SamSam   21    Kisii    1000

In [22]:
#Remove a column
df.drop('Salary', axis=1) # Tempory operation

     Name  Age     City
0  Angela   23  Nairobi
1    Jack   27  Mombasa
2    Paul   24   Kisumu
3  SamSam   21    Kisii

In [23]:
df

     Name  Age     City  Salary
0  Angela   23  Nairobi    7000
1    Jack   27  Mombasa    4000
2    Paul   24   Kisumu    9000
3  SamSam   21    Kisii    1000

In [24]:
df.drop('City', axis=1, inplace=True) # Permanent

In [25]:
df

     Name  Age  Salary
0  Angela   23    7000
1    Jack   27    4000
2    Paul   24    9000
3  SamSam   21    1000

In [26]:
# Add age to column
df['Age']=df['Age']+1

In [27]:
df

     Name  Age  Salary
0  Angela   24    7000
1    Jack   28    4000
2    Paul   25    9000
3  SamSam   22    1000

In [28]:
df.drop(0, inplace=True)

In [29]:
df

     Name  Age  Salary
1    Jack   28    4000
2    Paul   25    9000
3  SamSam   22    1000

In [30]:
dt=pd.read_csv('sales_data.csv')
print(dt.head(7))

   Transaction ID        Date Product Category                 Product Name  \
0           10001  2024-01-01      Electronics                iPhone 14 Pro
1           10002  2024-01-02  Home Appliances             Dyson V11 Vacuum
2           10003  2024-01-03         Clothing             Levi's 501 Jeans
3           10004  2024-01-04            Books            The Da Vinci Code
4           10005  2024-01-05  Beauty Products      Neutrogena Skincare Set
5           10006  2024-01-06           Sports  Wilson Evolution Basketball
6           10007  2024-01-07      Electronics          MacBook Pro 16-inch

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal
5           5       29.99         149.95           Asia    Credit Card
6           1     2499.99        2499.99  North America    Credit Card

In [31]:
# Display the data types of each columd
print("Data types: \n", dt.dtypes)

# Describe the DataFrame
print("Statistical summary: \n", dt.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000